src/DataProcessors/РабочееМестоКомплектовщик/РабочееМестоКомплектовщик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКомплектовщик</name>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НакладнаяНаСборку</name>
    <type>
      <types>DocumentRef.НакладнаяНаСборку</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаКомплектации</name>
    <type>
      <types>EnumRef.ЗоныКомплектации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/СтатусыНакладныхНаСборку/СтатусыНакладныхНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыНакладныхНаСборку</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыНакладнойНаСборку</types>
    </type>
  </resources>
  <dimensions>
    <name>НакладнаяНаСборку</name>
    <type>
      <types>DocumentRef.НакладнаяНаСборку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЯчейкиХранения/ЯчейкиХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЯчейкиХранения</name>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллажи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Стойка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Полка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыНакладнойНаСборку/СтатусыНакладнойНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыНакладнойНаСборку</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>НаСборке</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>НаУпаковке</name>
  </enumValues>
  <enumValues>
    <name>Упакован</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ЗоныКомплектации/ЗоныКомплектации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗоныКомплектации</name>
  <enumValues>
    <name>УПЭА</name>
  </enumValues>
  <enumValues>
    <name>УД</name>
  </enumValues>
  <enumValues>
    <name>ДД</name>
  </enumValues>
  <enumValues>
    <name>ТНП</name>
  </enumValues>
</mdclass:Enum>

src/Documents/НакладнаяНаСборку/НакладнаяНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НакладнаяНаСборку</name>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДоставки</name>
    <type>
      <types>CatalogRef.КартыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомераТары</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрупныйЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БарКоды</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>БарКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗоныКомплектации</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Тары</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.ТранспортировочныеТары</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Товары</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Исполнение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДанфосс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрупностьЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗапуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеНапряжениеБатарейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НумераторDanfoss</name>
    <type>
      <types>CatalogRef.НумераторDanfoss</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеФункциональноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стандартный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяIDКлюча</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяIMEI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяMACАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВводНапряженияБатарейки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяКодDanfoss</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяСерийныйНомерEnLogic</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуютсяДМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяBT_IMEI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакПриПолученииЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Канбан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EAN</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СторонняяПоверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрагМеталл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехОснастка</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЯчейкиХранения</name>
    <attributes>
      <name>ЯчейкаХранения</name>
      <type>
        <types>CatalogRef.ЯчейкиХранения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/РабочееМестоКомплектовщик/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Исполнитель = ПараметрыСеанса.Пользователь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаСервере
Процедура ПолучитьНаСборкуНаСервере()
Запрос = Новый Запрос;
СписокСтатусов = Новый СписокЗначений;

СписокСтатусов.Добавить(Перечисления.СтатусыНакладнойНаСборку.Создан);
СписокСтатусов.Добавить(Перечисления.СтатусыНакладнойНаСборку.НаСборке);

	Если ЗонаКомплектации = Перечисления.ЗоныКомплектации.ТНП Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НакладнаяНаСборкуТабличнаяЧасть.Ссылка КАК Ссылка,
		|	НакладнаяНаСборкуТабличнаяЧасть.Товар КАК Товар,
		|	НакладнаяНаСборкуТабличнаяЧасть.Продукция КАК Продукция,
		|	НакладнаяНаСборкуТабличнаяЧасть.Количество КАК Количество,
		|	НакладнаяНаСборкуТабличнаяЧасть.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|ИЗ
		|	Документ.НакладнаяНаСборку.ТабличнаяЧасть КАК НакладнаяНаСборкуТабличнаяЧасть
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыНакладныхНаСборку.СрезПоследних КАК СтатусыНакладныхНаСборкуСрезПоследних
		|		ПО НакладнаяНаСборкуТабличнаяЧасть.Ссылка = СтатусыНакладныхНаСборкуСрезПоследних.НакладнаяНаСборку
		|ГДЕ
		|	НакладнаяНаСборкуТабличнаяЧасть.Ссылка.Дата >= &ВыбДата
		|	И НакладнаяНаСборкуТабличнаяЧасть.Ссылка.Проведен = ИСТИНА
		|	И СтатусыНакладныхНаСборкуСрезПоследних.Статус В(&СписокСтатусов)
		|	И (ТИПЗНАЧЕНИЯ(НакладнаяНаСборкуТабличнаяЧасть.Продукция) = ТИП(Справочник.Материалы)
		|			ИЛИ НакладнаяНаСборкуТабличнаяЧасть.Продукция.Линейка.ЗонаКомплектации = &ЗонаКомплектации)";	
	Иначе	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НакладнаяНаСборкуТабличнаяЧасть.Ссылка КАК Ссылка,
		|	НакладнаяНаСборкуТабличнаяЧасть.Товар КАК Товар,
		|	НакладнаяНаСборкуТабличнаяЧасть.Продукция КАК Продукция,
		|	НакладнаяНаСборкуТабличнаяЧасть.Количество КАК Количество,
		|	НакладнаяНаСборкуТабличнаяЧасть.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|ИЗ
		|	Документ.НакладнаяНаСборку.ТабличнаяЧасть КАК НакладнаяНаСборкуТабличнаяЧасть
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыНакладныхНаСборку.СрезПоследних КАК СтатусыНакладныхНаСборкуСрезПоследних
		|		ПО НакладнаяНаСборкуТабличнаяЧасть.Ссылка = СтатусыНакладныхНаСборкуСрезПоследних.НакладнаяНаСборку
		|ГДЕ
		|	НакладнаяНаСборкуТабличнаяЧасть.Ссылка.Дата >= &ВыбДата
		|	И НакладнаяНаСборкуТабличнаяЧасть.Ссылка.Проведен = ИСТИНА
		|	И СтатусыНакладныхНаСборкуСрезПоследних.Статус В(&СписокСтатусов)
		|	И НакладнаяНаСборкуТабличнаяЧасть.Продукция.Линейка.ЗонаКомплектации = &ЗонаКомплектации";	
	КонецЕсли;
		Если ОбрабатываемаяДата = 0 Тогда	
		Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборкуТабличнаяЧасть.Ссылка.ДатаОтгрузки = &ДатаОтгрузки";
		Иначе
		Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборкуТабличнаяЧасть.Ссылка.ДатаОтгрузки <> &ДатаОтгрузки";
		КонецЕсли;
Запрос.Текст = Запрос.Текст + " ИТОГИ ПО Ссылка"; 
Запрос.УстановитьПараметр("ДатаОтгрузки", НачалоДня(ТекущаяДата()));
Запрос.УстановитьПараметр("ВыбДата", Дата(2021,2,17,0,0,0));
Запрос.УстановитьПараметр("ЗонаКомплектации", ЗонаКомплектации);
Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСсылка.Следующий() Цикл
	ВыборкаЗК = ВыборкаСсылка.Ссылка.ЗоныКомплектации.Найти(ЗонаКомплектации,"ЗонаКомплектации");
		Если ВыборкаЗК <> Неопределено Тогда
			Если Не ЗначениеЗаполнено(ВыборкаЗК.ДатаОкончания) Тогда
			ТЧ = ТаблицаНаСборку.Добавить();
			ТЧ.ННС = ВыборкаСсылка.Ссылка;
			ТЧ.Номер = СокрЛП(ТЧ.ННС.Номер);
			ТЧ.ДатаОтгрузки = ТЧ.ННС.ДатаОтгрузки;
			ТЧ.ДатаНачала = ВыборкаЗК.ДатаНачала;
				Если ТЧ.ННС.ЛинейкаУпаковки = 4 Тогда
				ТЧ.Приоритет = -1;				
				КонецЕсли; 
			ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
				ТЧ_Т = ТЧ.ТаблицаТоваров.Добавить();
				ТЧ_Т.Товар = ВыборкаДетальныеЗаписи.Товар;
				ТЧ_Т.Продукция = ВыборкаДетальныеЗаписи.Продукция;
				ТЧ_Т.Количество = ВыборкаДетальныеЗаписи.Количество;
				ТЧ_Т.ЗНП = ВыборкаДетальныеЗаписи.ЗаказНаПроизводство;
				КонецЦикла;
			КонецЕсли;
		Иначе
		Сообщить("В ННС №"+ВыборкаСсылка.Ссылка.Номер+" не определены зоны комплектации!");
		КонецЕсли;
	КонецЦикла;
ТаблицаНаСборку.Сортировать("Приоритет,ДатаОтгрузки,Номер");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНаСборку(Команда)
	Если Не ЗонаКомплектации.Пустая() Тогда
	ТаблицаНаСборку.Очистить();
	ПолучитьНаСборкуНаСервере();
	Иначе
	Сообщить("Выберите зону комплектации!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатьННСНаСервере()
ТабДок = Новый ТабличныйДокумент;
ТаблицаННС = Новый ТаблицаЗначений;
СписокСчетов = Новый СписокЗначений;

ТаблицаННС.Колонки.Добавить("Товар");
ТаблицаННС.Колонки.Добавить("Продукция");
ТаблицаННС.Колонки.Добавить("ГруппаЛинеек");
ТаблицаННС.Колонки.Добавить("Порядок");
ТаблицаННС.Колонки.Добавить("Количество");

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблТовар = Макет.ПолучитьОбласть("Товар");
ОблКонец = Макет.ПолучитьОбласть("Конец");
	Для каждого ТЧ Из ТаблицаНаСборку Цикл
		Если ЗначениеЗаполнено(ТЧ.ДатаНачала) Тогда
		Продолжить;
		КонецЕсли; 
	ТаблицаННС.Очистить();
	СписокСчетов.Очистить();
		Для каждого ТЧ_ТЧ Из ТЧ.ТаблицаТоваров Цикл	
		ТЧ_ННС = ТаблицаННС.Добавить();
		ТЧ_ННС.Товар = ТЧ_ТЧ.Товар;	
		ТЧ_ННС.Продукция = ТЧ_ТЧ.Продукция;	
		ТЧ_ННС.ГруппаЛинеек = ТЧ_ТЧ.Продукция.Линейка.Родитель;
		ТЧ_ННС.Порядок = ТЧ_ТЧ.Продукция.Линейка.Родитель.Порядок;
		ТЧ_ННС.Количество =ТЧ_ТЧ.Количество;
		Выборка = СписокСчетов.НайтиПоЗначению(СокрЛП(ТЧ_ТЧ.ЗНП.Номер));
			Если Выборка = Неопределено Тогда
			СписокСчетов.Добавить(СокрЛП(ТЧ_ТЧ.ЗНП.Номер));		
			КонецЕсли;
		КонецЦикла;
	ТаблицаННС.Свернуть("Порядок,ГруппаЛинеек,Товар,Продукция","Количество");
	ТаблицаННС.Сортировать("Порядок,ГруппаЛинеек,Товар,Продукция");
	КоличествоВсего = 0;
	ОблШапка.Параметры.Контрагент = ТЧ.ННС.Контрагент;
	ОблШапка.Параметры.ТранспортнаяКомпания = ТЧ.ННС.КартаДоставки.ТрансКом;
	ОблШапка.Параметры.Город = ТЧ.ННС.КартаДоставки.Город;
	ОблШапка.Параметры.Номер = ТЧ.ННС.Номер;
	ОблШапка.Параметры.ДатаОтгрузки = Формат(ТЧ.ННС.Ссылка.ДатаОтгрузки,"ДЛФ=DD")+" ("+Формат(ТЧ.ННС.Ссылка.ДатаОтгрузки,"ДФ=дддд")+")";
	ОблШапка.Параметры.НомерЛинейкиУпаковки = ТЧ.ННС.ЛинейкаУпаковки;
	ОблШапка.Параметры.НомераСчетов = СписокСчетов;
	ТабДок.Вывести(ОблШапка);
	QRCode = СокрЛП(ТЧ.ННС.Номер)+";"+ЗначениеВСтрокуВнутр(ТЧ.ННС)+";"+Строка(Перечисления.ЗоныКомплектации.Индекс(ЗонаКомплектации));
		Для каждого ТЧ_ННС Из ТаблицаННС Цикл
			Если ТипЗнч(ТЧ_ННС.Продукция) = Тип("СправочникСсылка.Материалы") Тогда
            ОблТовар.Параметры.Линейка = "ТНП";
			Иначе
			ОблТовар.Параметры.Линейка = ТЧ_ННС.ГруппаЛинеек;
			КонецЕсли;		
		ОблТовар.Параметры.Товар = ТЧ_ННС.Товар;
		ОблТовар.Параметры.Артикул = ТЧ_ННС.Товар.Код;
		ОблТовар.Параметры.Количество = ТЧ_ННС.Количество;
		ОблТовар.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ_ННС.Продукция.ЕдиницаИзмерения.Наименование);
		ОблТовар.Параметры.Стеллаж = "";
		ОблТовар.Параметры.Стойка = "";
		ОблТовар.Параметры.Полка = "";
		ОблТовар.Параметры.Ячейка = "";
		ЯчейкиХранения = РегистрыСведений.ЯчейкиХранения.Выбрать(Новый Структура("МПЗ",ТЧ_ННС.Продукция));
			Пока ЯчейкиХранения.Следующий() Цикл
			ОблТовар.Параметры.Стеллаж = ЯчейкиХранения.Стеллаж;
			ОблТовар.Параметры.Стойка = ЯчейкиХранения.Стойка;
			ОблТовар.Параметры.Полка = ЯчейкиХранения.Полка;
			ОблТовар.Параметры.Ячейка = ЯчейкиХранения.Ячейка;		
			КонецЦикла;		
		ТабДок.Вывести(ОблТовар);
		QRCode = QRCode+";"+ТЧ_ННС.Товар.Код+";"+ТЧ_ННС.Количество;
		КоличествоВсего = КоличествоВсего + ТЧ_ННС.Количество;
		КонецЦикла;
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRCode, 0, 500);	
		Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
		КартинкаQRКода = Новый Картинка(ДанныеQRКода);
		ОблКонец.Рисунки.QRCode.Картинка = КартинкаQRКода;
		Иначе
		Сообщить("Не удалось сформировать QR-код!");
		КонецЕсли;
	ОблКонец.Параметры.Количество = КоличествоВсего;
	ОблКонец.Параметры.Комментарий = ТЧ.ННС.Комментарий;
	ТабДок.Вывести(ОблКонец);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
ТабДок.ПолеСлева =0;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
Возврат(ТабДок); 
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
ТД = ПечатьННСНаСервере();
ТД.Показать("Накладные на сборку");
КонецПроцедуры

&НаСервере
Функция ПечатьПовторнаяНаСервере(Стр)
ТЧ = ТаблицаНаСборку.НайтиПоИдентификатору(Стр);
ТабДок = Новый ТабличныйДокумент;
ТаблицаННС = Новый ТаблицаЗначений;
СписокСчетов = Новый СписокЗначений;

ТаблицаННС.Колонки.Добавить("Товар");
ТаблицаННС.Колонки.Добавить("Продукция");
ТаблицаННС.Колонки.Добавить("ГруппаЛинеек");
ТаблицаННС.Колонки.Добавить("Порядок");
ТаблицаННС.Колонки.Добавить("Количество");

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблТовар = Макет.ПолучитьОбласть("Товар");
ОблКонец = Макет.ПолучитьОбласть("Конец");
	Для каждого ТЧ_ТЧ Из ТЧ.ТаблицаТоваров Цикл	
	ТЧ_ННС = ТаблицаННС.Добавить();
	ТЧ_ННС.Товар = ТЧ_ТЧ.Товар;	
	ТЧ_ННС.Продукция = ТЧ_ТЧ.Продукция;	
	ТЧ_ННС.ГруппаЛинеек = ТЧ_ТЧ.Продукция.Линейка.Родитель;
	ТЧ_ННС.Порядок = ТЧ_ТЧ.Продукция.Линейка.Родитель.Порядок;
	ТЧ_ННС.Количество =ТЧ_ТЧ.Количество;
	Выборка = СписокСчетов.НайтиПоЗначению(СокрЛП(ТЧ_ТЧ.ЗНП.Номер));
		Если Выборка = Неопределено Тогда
		СписокСчетов.Добавить(СокрЛП(ТЧ_ТЧ.ЗНП.Номер));		
		КонецЕсли;
	КонецЦикла;
ТаблицаННС.Свернуть("Порядок,ГруппаЛинеек,Товар,Продукция","Количество");
ТаблицаННС.Сортировать("Порядок,ГруппаЛинеек,Товар,Продукция");
КоличествоВсего = 0;
ОблШапка.Параметры.Контрагент = ТЧ.ННС.Контрагент;
ОблШапка.Параметры.ТранспортнаяКомпания = ТЧ.ННС.КартаДоставки.ТрансКом;
ОблШапка.Параметры.Город = ТЧ.ННС.КартаДоставки.Город;
ОблШапка.Параметры.Номер = ТЧ.ННС.Номер;
ОблШапка.Параметры.ДатаОтгрузки = Формат(ТЧ.ННС.Ссылка.ДатаОтгрузки,"ДЛФ=DD")+" ("+Формат(ТЧ.ННС.Ссылка.ДатаОтгрузки,"ДФ=дддд")+")";
ОблШапка.Параметры.НомерЛинейкиУпаковки = ТЧ.ННС.ЛинейкаУпаковки;
ОблШапка.Параметры.НомераСчетов = СписокСчетов;
ТабДок.Вывести(ОблШапка);
QRCode = СокрЛП(ТЧ.ННС.Номер)+";"+ЗначениеВСтрокуВнутр(ТЧ.ННС)+";"+Строка(Перечисления.ЗоныКомплектации.Индекс(ЗонаКомплектации));
	Для каждого ТЧ_ННС Из ТаблицаННС Цикл
		Если ТипЗнч(ТЧ_ННС.Продукция) = Тип("СправочникСсылка.Материалы") Тогда
        ОблТовар.Параметры.Линейка = "ТНП";
		Иначе
		ОблТовар.Параметры.Линейка = ТЧ_ННС.ГруппаЛинеек;
		КонецЕсли;		
	ОблТовар.Параметры.Товар = ТЧ_ННС.Товар;
	ОблТовар.Параметры.Артикул = ТЧ_ННС.Товар.Код;
	ОблТовар.Параметры.Количество = ТЧ_ННС.Количество;
	ОблТовар.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ_ННС.Продукция.ЕдиницаИзмерения.Наименование);
	ОблТовар.Параметры.Стеллаж = "";
	ОблТовар.Параметры.Стойка = "";
	ОблТовар.Параметры.Полка = "";
	ОблТовар.Параметры.Ячейка = "";
	ЯчейкиХранения = РегистрыСведений.ЯчейкиХранения.Выбрать(Новый Структура("МПЗ",ТЧ_ННС.Продукция));
		Пока ЯчейкиХранения.Следующий() Цикл
		ОблТовар.Параметры.Стеллаж = ЯчейкиХранения.Стеллаж;
		ОблТовар.Параметры.Стойка = ЯчейкиХранения.Стойка;
		ОблТовар.Параметры.Полка = ЯчейкиХранения.Полка;
		ОблТовар.Параметры.Ячейка = ЯчейкиХранения.Ячейка;		
		КонецЦикла;		
	ТабДок.Вывести(ОблТовар);
	QRCode = QRCode+";"+ТЧ_ННС.Товар.Код+";"+ТЧ_ННС.Количество;
	КоличествоВсего = КоличествоВсего + ТЧ_ННС.Количество;
	КонецЦикла;
ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRCode, 0, 500);	
	Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
	КартинкаQRКода = Новый Картинка(ДанныеQRКода);
	ОблКонец.Рисунки.QRCode.Картинка = КартинкаQRКода;
	Иначе
	Сообщить("Не удалось сформировать QR-код!");
	КонецЕсли;
ОблКонец.Параметры.Количество = КоличествоВсего;
ОблКонец.Параметры.Комментарий = ТЧ.ННС.Комментарий;
ТабДок.Вывести(ОблКонец);
ТабДок.ПолеСлева =0;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ПечатьПовторная(Команда)
ТД = ПечатьПовторнаяНаСервере(Элементы.ТаблицаНаСборку.ТекущаяСтрока);
ТД.Показать("Накладная на сборку");
КонецПроцедуры

&НаСервере
Процедура ИзменитьНаСборкуНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;		
		Для каждого ТЧ Из ТаблицаНаСборку Цикл
		ННС = ТЧ.ННС.ПолучитьОбъект();
		ВыборкаЗК = ННС.ЗоныКомплектации.Найти(ЗонаКомплектации,"ЗонаКомплектации");
		ВыборкаЗК.Исполнитель = Исполнитель;
			Если Не ЗначениеЗаполнено(ВыборкаЗК.ДатаНачала) Тогда
			ВыборкаЗК.ДатаНачала = ТекущаяДата();
			КонецЕсли;
		ННС.Записать(РежимЗаписиДокумента.Запись);
		СтатусыННС = РегистрыСведений.СтатусыНакладныхНаСборку.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("НакладнаяНаСборку",ТЧ.ННС));
			Если СтатусыННС.Статус = Перечисления.СтатусыНакладнойНаСборку.Создан Тогда			
			СННС = РегистрыСведений.СтатусыНакладныхНаСборку.СоздатьМенеджерЗаписи();
			СННС.Период = ТекущаяДата();
			СННС.НакладнаяНаСборку = ТЧ.ННС;
			СННС.Статус = Перечисления.СтатусыНакладнойНаСборку.НаСборке;
			СННС.Записать();		
			КонецЕсли; 
		КонецЦикла;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());
	КонецПопытки; 
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаСборку(Команда)
ИзменитьНаСборкуНаСервере();
ТаблицаНаСборку.Очистить();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанные(Данные)
Массив = ОбщийМодульВызовСервера.РазложитьСтрокуВМассив(Данные,";");
ННС = ЗначениеИзСтрокиВнутр(Массив[1]);
Объект.ЗонаКомплектации = Перечисления.ЗоныКомплектации.Получить(Число(Массив[2]));
	Если ПроверитьСтатусННС(ННС) Тогда
	Объект.НакладнаяНаСборку = ННС;
	флЧётность = Ложь;
		Для к = 3 По Массив.ВГраница() Цикл
			Если флЧётность Тогда
			флЧётность = Ложь;
			Иначе
			ТЧ = Объект.ТабличнаяЧасть.Добавить();
			ТЧ.Товар = Справочники.Товары.НайтиПоКоду(Число(Массив[к]));
			ТЧ.Количество = Число(Массив[к+1]);	
			флЧётность = Истина;
			КонецЕсли;	
		КонецЦикла;
	Иначе
	Сообщить("Отсканируйте документ в статусе На сборке!");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудника(Данные)
Возврат(ЗначениеИзСтрокиВнутр(Данные));
КонецФункции

&НаСервере
Процедура ДобавитьТару(Данные)
Массив = ОбщийМодульВызовСервера.РазложитьСтрокуВМассив(Данные,";");
Тара = ЗначениеИзСтрокиВнутр(Массив[1]);
	Если НомераТары.НайтиПоЗначению(Тара) = Неопределено Тогда
		Если Объект.НакладнаяНаСборку.Тары.Найти(Тара,"Тара") = Неопределено Тогда
		НомераТары.Добавить(Тара);
		Иначе
		Сообщить("Тара уже добавлена в накладную на сборку!");
		КонецЕсли;
	Иначе
	Сообщить("Тара уже отсканирована!");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
		Если Найти(Данные,"Тара") > 0 Тогда
		ДобавитьТару(Данные); 
		ИначеЕсли Найти(Данные,";") > 0 Тогда
		ПолучитьДанные(Данные);
		ИначеЕсли Найти(Данные,"{") > 0 Тогда	
		Объект.Исполнитель = ПолучитьСотрудника(Данные);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанные(Команда)
		Если Найти(ДанныеСканера,"Тара") > 0 Тогда
		ДобавитьТару(ДанныеСканера); 
		ИначеЕсли Найти(ДанныеСканера,";") > 0 Тогда
		ПолучитьДанные(ДанныеСканера);
		ИначеЕсли Найти(ДанныеСканера,"{") > 0 Тогда	
		Объект.Исполнитель = ПолучитьСотрудника(ДанныеСканера);
		КонецЕсли;
ДанныеСканера = "";
КонецПроцедуры

&НаСервере
Процедура ДобавитьТоварыВТаблицу()
Объект.ТабличнаяЧасть.Очистить();
	Для каждого ТЧ Из Объект.НакладнаяНаСборку.ТабличнаяЧасть Цикл
		Если ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
			Если ТЧ.Продукция.Линейка.ЗонаКомплектации = Объект.ЗонаКомплектации Тогда
			ТЧ_ТЧ = Объект.ТабличнаяЧасть.Добавить();
			ТЧ_ТЧ.Товар = ТЧ.Товар;
			ТЧ_ТЧ.Количество = ТЧ.Количество;
			КонецЕсли;
		Иначе
			Если Объект.ЗонаКомплектации = Перечисления.ЗоныКомплектации.ТНП Тогда
			ТЧ_ТЧ = Объект.ТабличнаяЧасть.Добавить();
			ТЧ_ТЧ.Товар = ТЧ.Товар;
			ТЧ_ТЧ.Количество = ТЧ.Количество;			
			КонецЕсли; 		
		КонецЕсли; 			
	КонецЦикла;  
КонецПроцедуры
 
&НаСервере
Функция ПроверитьСтатусННС(НакладнаяНаСборку)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыНакладныхНаСборкуСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыНакладныхНаСборку.СрезПоследних(&НаДату, НакладнаяНаСборку = &НакладнаяНаСборку) КАК СтатусыНакладныхНаСборкуСрезПоследних";
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.УстановитьПараметр("НакладнаяНаСборку", НакладнаяНаСборку);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Статус = Перечисления.СтатусыНакладнойНаСборку.НаСборке Тогда
		Возврат(Истина);
		Иначе
		Возврат(Ложь);
		КонецЕсли; 
	КонецЦикла;
Возврат(Ложь);
КонецФункции

&НаКлиенте
Процедура НакладнаяНаСборкуПриИзменении(Элемент)
	Если ПроверитьСтатусННС(Объект.НакладнаяНаСборку) Тогда	
	ДобавитьТоварыВТаблицу();
	Иначе
	Сообщить("Выберите документ в статусе На сборке!");
	Объект.НакладнаяНаСборку = "";
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьЗаданиеНаСервере()
ДатаОкончания = ТекущаяДата();
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	ННС = Объект.НакладнаяНаСборку.ПолучитьОбъект();
	ВыборкаЗК = ННС.ЗоныКомплектации.Найти(Объект.ЗонаКомплектации,"ЗонаКомплектации");
	ВыборкаЗК.ДатаОкончания = ТекущаяДата();
	ВыборкаЗК.Исполнитель = Объект.Исполнитель;
		Для каждого НомерТары Из НомераТары Цикл 
		ВыборкаТ = ННС.Тары.НайтиСтроки(Новый Структура("ЗонаКомплектации,Тара",Объект.ЗонаКомплектации,НомерТары.Значение));
			Если ВыборкаТ.Количество() = 0 Тогда
			ТЧ_Т = ННС.Тары.Добавить();
			ТЧ_Т.Тара = НомерТары.Значение;
			ТЧ_Т.ЗонаКомплектации = Объект.ЗонаКомплектации;
			ТЧ_Т.ДатаНачала = ТекущаяДата();			
			Иначе	
			ВыборкаТ[0].ДатаНачала = ТекущаяДата();			
			КонецЕсли;		 		
		КонецЦикла;	
	ННС.Записать(РежимЗаписиДокумента.Запись);
	Объект.ЗонаКомплектации = Перечисления.ЗоныКомплектации.ПустаяСсылка();
	Объект.НакладнаяНаСборку = Документы.НакладнаяНаСборку.ПустаяСсылка();
	НомераТары.Очистить();
	Объект.ТабличнаяЧасть.Очистить();
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());
	КонецПопытки; 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗадание(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ЗавершитьЗаданиеНаСервере();
	КонецЕсли;
КонецПроцедуры
